graph = {'长安城': set(['天策', '佛门','大唐国境','长安城外']),
         '佛门': set(['大雄宝殿','长安城']),
         '大雄宝殿': set(['佛门']),
         '天策': set(['程府','长安城']),
         '程府': set(['天策']),


         '大唐国境': set(['大唐境外', '南海普陀', '长安城']),
         '南海普陀': set(['大唐国境']),


         '大唐境外': set(['盘丝岭', '乌斯藏','女儿国','幽冥地府','大唐国境']),
         '女儿国': set(['大唐境外']),
         '幽冥地府': set(['大唐境外','森罗殿']),
         '森罗殿': set(['幽冥地府']),
         '盘丝岭': set(['大唐境外','盘丝洞']),
         '盘丝洞': set(['盘丝岭']),


         '乌斯藏': set(['五庄观','魔王山','临仙镇','万兽岭','大唐境外']),
         '万兽岭': set(['狮王洞','乌斯藏']),
         '狮王洞': set(['万兽岭']),
         '五庄观': set(['乾坤殿','乌斯藏']),
         '乾坤殿': set(['五庄观']),
         '魔王山': set(['乌斯藏']),


         '临仙镇': set(['乌斯藏','昆仑山','方寸山']),
         '方寸山': set(['临仙镇','灵台宫']),
         '灵台宫': set(['方寸山']),


         '昆仑山': set(['凌霄天宫','北冥','临仙镇']),
         '北冥': set(['昆仑山']),
         '凌霄天宫': set(['昆仑山','凌霄殿']),
         '凌霄殿': set(['凌霄天宫']),

         '花果山': set(['傲来国']),

         '傲来国': set(['清河镇外', '天魔里','花果山']),
         '天魔里': set(['云隐阁','傲来国']),
         '云隐阁': set(['天魔里','傲来国']),

         '清河镇外': set(['傲来国', '东海龙宫','清河镇','神秘']),
         '神秘': set(['清河镇外']),
         '东海龙宫': set(['水晶宫','清河镇外']),
         '水晶宫': set(['东海龙宫']),

         '长安城外': set(['长安城', '清河镇']),
         '清河镇': set(['长安城外','清河镇外']),
         }
